# Esta parecemas DEMO que práctica 
Para esta páctica usaremos la base de datos `Pruebas`

In [1]:
--Ejecute este bloque(colapsado) para usarla 

IF NOT EXISTS 
   (
     SELECT name FROM master.dbo.sysdatabases 
     WHERE name = 'Pruebas'
    )
CREATE DATABASE Pruebas

GO
use Pruebas

# Restricciones ( Constraints )

Una restriccion puede ser a nivel tabla

In [0]:

CREATE TABLE RCT1
(
    NombreCompleto VARCHAR(30) not NULL, 
    Departamento varchar(30),
    Salario NUMERIC (10,4)
)

O a nivel tabla

In [0]:
CREATE TABLE TT1
(
    Nombre VARCHAR(30) not NULL, 
    Apellido VARCHAR(30),
    Departamento varchar(30),
    Salario NUMERIC (10,4)
    PRIMARY KEY (Empleado, Nombre)
)

# Constraint Default 
A una columna se le puede asignar un valor, en caso de que el usuario no provea uno. Por ejemplo, en una empresa de origen mexicano, en el atributo `País` el valor por defecto bien podría ser `México`.

In [28]:
CREATE TABLE Empleados
(
    IdEmpleado int PRIMARY KEY,
    Nombre NVARCHAR(30) not NULL, 
    Apellido NVARCHAR(30),
    Pais NVARCHAR(50) DEFAULT 'México'
)

In [29]:
INSERT INTO Empleados (idEmpleado, Nombre, Apellido) 
    VALUES (1, 'Juan', 'Pérez')
INSERT INTO Empleados (idEmpleado, Nombre, Apellido, Pais) 
    VALUES (2, 'Francisco', 'Hernández', 'Estados Unidos')

In [30]:
SELECT * from Empleados

# Default cuando la tabla ya tiene datos

In [31]:
ALTER TABLE Empleados
    Add Departamento nvarchar(30) DEFAULT 'Ventas'

SELECT * from Empleados

# WITH VALUES

In [32]:
ALTER TABLE Empleados
    add Salario NUMERIC(10,4) DEFAULT 900.200 WITH VALUES

SELECT * from Empleados